---
kind: property
id: P:Autodesk.Revit.DB.Events.PreDocEventArgs.Document
zh: 文档、文件
source: html/ce65e6e8-2bcb-20cf-3927-4eac5b1efdc1.htm
---
# Autodesk.Revit.DB.Events.PreDocEventArgs.Document Property

**中文**: 文档、文件

The document associated with the event.

## Syntax (C#)
```csharp
public Document Document { get; }
```